app/Controllers/Penilaian.php

SELECT DISTINCT "unit_kerja"
FROM "unit_kerja"
SELECT *
FROM "unit_kerja"
---
public function form()
{
    $model = new UnitKerjaModel();

    // Ambil unit kerja unik saja (tanpa duplikat)
    $data['unit_kerja'] = $model->select('unit_kerja')->distinct()->findAll();

    // Ambil semua sub unit kerja (nanti digunakan oleh JS)
    $data['sub_unit_kerja'] = $model->findAll();