app/Controllers/Teknologi.php

    public function form()
    {
        $unitModel = new UnitKerjaModel();

        $data['unit_kerja'] = $unitModel->select('unit_kerja')->distinct()->findAll();
        $data['sub_unit_kerja'] = $unitModel->findAll();
---
SELECT DISTINCT "unit_kerja"
FROM "unit_kerja"
SELECT *
FROM "unit_kerja"